{
    "report": {
      "favourablePoints": [
        {
          "type": "KEY_VALUE",
          "heading": "Favourable Points",
          "data": {
            "name": "Sumit Gupta",
            "date_of_birth": "9-2-1999",
            "destiny_number": 3,
            "radical_number": 9,
            "name_number": 4,
            "evil_number": "7",
            "favourite_colour": "Brick Red",
            "favourite_day": "Tuesday, Wednesday, Friday",
            "favourite_god": "Hanuman",
            "favourite_mantra": "|| Om Ang Angaarakaay Namah ||",
            "favourite_metal": "Copper",
            "favourite_stone": "Red coral",
            "favourite_substones": "Sangmoongi",
            "friendly_numbers": "1,2,3,6",
            "neutral_number": "4,5,8",
            "radical_ruler": "Mars"
          }
        }
      ],
      "numerologyReport": [
        {
          "type": "PARAGRAPH",
          "heading": "Radical Number",
          "data": [
            " Your Radical number is 9. Its ruler is Mars. Mars is regarded as commander - in - chief of planet. Therefore you will also have a desire to become a General, chief, leader etc in social field. You would like to monopolize in your job or business.  By virtue of your inherent courage, you will cross hurdles easily by showing daring and nerves. By nature, you will be quick and in hurry. You will strive to finish your work as early as possible.  As you are a headstrong person, you should keep yourself away from reckless ventures. You are disciplined your self and appreciate discipline from others.  You may be misled by flattery and sycophancy, which may harm you. Keep yourself away from sycophants.  You may be a short-tempered person due to the influence of Mars. This will generate many opponents for you.  Though, your enemies will be less, as you will ever have capacity to crush your enemies.You may suffer from diseases related to fire elements. Therefore, you are advised to remain calm and quite for good luck. "
          ]
        },
        {
          "type": "PARAGRAPH",
          "heading": "Favourable Time",
          "data": [
            " According to western view Sun remains in Aries from 23rd March to 20th April and in Scorpio from 24th October to 21st November. According to Indian thought this period is from 13th April to 12th May and from 14th November to 14th December.  The Aries and Scorpio are own signs of the Mars. Therefore above mentioned periods are lucky for Radical number 9 persons for initiating any new or important work. "
          ]
        },
        {
          "type": "PARAGRAPH",
          "heading": "Favourable Gayatri Mantra",
          "data": [
            " You should recite Mangal Gayatri Mantra daily in the morning after bath, 11, 21 or 108 times for benefic effects.  The mangal (Mars) Gayatri Mantra.  || \"Om Angarkay Vidmahe Shaktihastay Dheemhi Tanno Bhaumah Prachodyat\" || "
          ]
        }
      ],
      "ascendantReport": [
        {
          "type": "KEY_PARAGRAPH",
          "heading": "Ascendant Report",
          "data": {
            "ascendant": "Aries",
            "report": "People with Aries rising tend to be energetic, pioneering, rash, argumentative, selfish, impulsive, quick-tempered, aggressive, assertive, headstrong, independent, alert, mechanically-inclined, physically active, self-promoting, self-centered in an unthinking way, and more thoughtless than mean. You have a general dislike for restraint of any kind, don't like to be told what to do, need to learn diplomacy and tact, need to look before leaping, need to better learn how to channel your energies for more constructive purposes and results. Like the ram who symbolizes this sign, you tend to butt your head against your problems hoping that with enough force you can eventually knock down whatever stands before you, including people. You like the challenges of life and are very competitive and sometimes combative. You get bored easily with routine and one thing you may need to practice more of is persistence. You tend to jump from one thing to another, always looking for something new. Finish what you start before moving on. Spiritual lesson to learn: Patience. Mars rules Aries so Mars will be important in your chart."
          }
        }
      ]
    },
    "houseCuspsAndSandhi": [
      {
        "type": "TABLE",
        "heading": "House Cusps And Sandhi",
        "data": [
          {
            "house": 1,
            "degree": "24:45:27",
            "sign": "Aries",
            "sign_lord": "Mars",
            "start_lord": "Venus",
            "sub_lord": "Mercury"
          },
          {
            "house": 2,
            "degree": "52:25:37",
            "sign": "Taurus",
            "sign_lord": "Venus",
            "start_lord": "Moon",
            "sub_lord": "Venus"
          },
          {
            "house": 3,
            "degree": "75:51:56",
            "sign": "Gemini",
            "sign_lord": "Mercury",
            "start_lord": "Rahu",
            "sub_lord": "Venus"
          },
          {
            "house": 4,
            "degree": "99:43:23",
            "sign": "Cancer",
            "sign_lord": "Moon",
            "start_lord": "Saturn",
            "sub_lord": "Venus"
          },
          {
            "house": 5,
            "degree": "127:56:12",
            "sign": "Leo",
            "sign_lord": "Sun",
            "start_lord": "Ketu",
            "sub_lord": "Jupiter"
          },
          {
            "house": 6,
            "degree": "163:48:49",
            "sign": "Virgo",
            "sign_lord": "Mercury",
            "start_lord": "Moon",
            "sub_lord": "Rahu"
          },
          {
            "house": 7,
            "degree": "204:45:27",
            "sign": "Libra",
            "sign_lord": "Venus",
            "start_lord": "Jupiter",
            "sub_lord": "Mercury"
          },
          {
            "house": 8,
            "degree": "232:25:37",
            "sign": "Scorpio",
            "sign_lord": "Mars",
            "start_lord": "Mercury",
            "sub_lord": "Moon"
          },
          {
            "house": 9,
            "degree": "255:51:56",
            "sign": "Sagittarius",
            "sign_lord": "Jupiter",
            "start_lord": "Venus",
            "sub_lord": "Sun"
          },
          {
            "house": 10,
            "degree": "279:43:23",
            "sign": "Capricorn",
            "sign_lord": "Saturn",
            "start_lord": "Sun",
            "sub_lord": "Venus"
          },
          {
            "house": 11,
            "degree": "307:56:12",
            "sign": "Aquarius",
            "sign_lord": "Saturn",
            "start_lord": "Rahu",
            "sub_lord": "Rahu"
          },
          {
            "house": 12,
            "degree": "343:48:49",
            "sign": "Pisces",
            "sign_lord": "Jupiter",
            "start_lord": "Saturn",
            "sub_lord": "Rahu"
          }
        ]
      }
    ],
    "dosha": {
      "kalsarpaDosha": [
        {
          "type": "KEY_PARAGRAPH",
          "heading": "Kalsarpa Details",
          "data": {
            "present": false,
            "one_line": "Kalsarpa dosha is not detected in your horoscope."
          }
        },
        {
          "type": "PARAGRAPH",
          "heading": "Kalsarpa Remedies",
          "data": [
            "Install an energized Kaal Sarpa Yog yantra at the place of veneration or puja room at home and worship it daily.",
            "Get a Kalsarpa dosha nivaran pooja performed on a Wednesday or Friday to negate the malefic effects of Rahu.",
            "Rudrabhisheka - a puja to Lord Shiva can be performed on a solar or lunar eclipse or on Mahashivratri at Mahakaleshwar temple, Ujjain or Kashi Vishwanath temple or any other Shiv Temple.",
            "Get a Dashansh Homa or Yajna done on Nag Panchami day in the month of Shravan in a temple or near a holy river.",
            "Donate fresh reddish.",
            "Wear a 14 faced rudraksha or a combination of 8+9 faced rudraksha."
          ]
        }
      ],
      "manglikDosha": [
        {
          "type": "KEY_PARAGRAPH",
          "heading": "Manglik Details",
          "data": {
            "manglik_present_rule": {
              "based_on_aspect": [
                "Twelfth house of your birth chart is aspected by Rahu.",
                "Rahu is aspecting eighth house of your birth chart.",
                "Seventh house of your birth chart is aspected by Saturn",
                "Mars is aspecting second house of your birth chart.",
                "Ketu is aspecting second house of your birth chart.",
                "Your first house in birth chart is aspected by planet Mars.",
                "Fourth house of your birth chart is aspected by Sun",
                "Fourth house of your birth chart is aspected by Ketu"
              ],
              "based_on_house": [
                "Planet Saturn is in First house in your horoscope.",
                "Planet Rahu is situated in Fourth house in your birth chart.",
                "Seventh house is occupied by planet Mars in your birth chart."
              ]
            },
            "manglik_cancel_rule": [],
            "is_mars_manglik_cancelled": false,
            "manglik_status": "EFFECTIVE",
            "percentage_manglik_present": 24.75,
            "percentage_manglik_after_cancellation": 24.75,
            "manglik_report": "Manglik dosha has been detected in your horosocpe and the extent of mangal dosha present is effective and therefore needs due carefulness. You are manglik.",
            "is_present": true,
            "what_is_manglik_dosha_?": "In the boy or the girls horoscope when Mars,Sun,Saturn,Rahu Or Ketu is in ascendant, fourth house, seventh house, eighth house or twelth house then it is called Manglik dosh. Manglik dosh is considered stronger when Mars is placed in the ascendant than when Mars is conjoined with Moon in ascendant. If according to the Shastras the Manglik dosh of both the boy and the girl is getting cancelled then they are guaranteed a happily married life. On the other hand, if this Manglik dosh is not cancelled then they are likely to face unnecessary problems andhurdles in life. So one must begin his/her married life after getting their horoscopes thoroughly matched. After getting the Manglik dosh properly cancelled the native shall be bestowed with a peaceful and wealthy life."
          }
        },
        {
          "type": "PARAGRAPH",
          "heading": "Manglik Remedies",
          "data": [
            "Install an energized Mangal Yantra in your place of worship. Meditate on the triangular Mangal Yantra along with the recitation of Mangal mantra: Om Kram Krim Krom Sah Bhomayay Namah",
            "In the evening, visit a Hanuman temple draw a triangle with red kumkum (roli) on a plate and worship Hanumanji with sindoor or red sandalwood, red flowers and a lighted lamp.",
            "Worship Lord Hanuman with the mantra:||OM SHREEM HANUMATE NAMAH||"
          ]
        }
      ],
      "sadhesatiAnalysis": [
        {
          "type": "KEY_PARAGRAPH",
          "heading": "Sadhesati Details",
          "data": {
            "consideration_date": "19-1-2024",
            "is_saturn_retrograde": false,
            "moon_sign": "Scorpio",
            "saturn_sign": "Aquarius",
            "is_undergoing_sadhesati": "No, currently you are not undergoing Sadhesati.",
            "sadhesati_status": false,
            "what_is_sadhesati_?": "Sadhe Sati refers to the seven-and-a-half year period in which Saturn moves through three signs, the moon sign, one before the moon and the one after it. Sadhe Sati starts when Saturn (Shani) enters the 12th sign from the birth Moon sign and ends when Saturn leaves 2nd sign from the birth Moon sign.  Since Saturn approximately takes around two and half years to transit a sign which is called Shani's dhaiya  it takes around seven and half year to transit three signs  and that is why it is known as Sadhe Sati. Generally Sade-Sati comes thrice in a horoscope in the life time - first in childhood, second in youth & third in old-age. First Sade-Sati has effect on education & parents. Second Sade-Sati has effect on profession, finance & family. The last one affects health more than anything else."
          }
        },
        {
          "type": "PARAGRAPH",
          "heading": "Sadhesati Remedies",
          "data": [
            "Give respect to your subordinate, servant, poor and lower class people.",
            "Serve and respect your parents and elderly people.",
            "Recite Shri Hanuman Chalisa.",
            "Shani Yantra is used to pacify an afflicted Shani and get  blessings of Lord Shani. When Saturn is malefic in a horoscope due to wrong placement, Sadhe Sati or Small Affliction,  use of Shani Yantra is very Beneficial. ",
            "It is good and beneficial to fast on Saturdays starting from sunrise to ending at sunset when Sadhe Sati is in effect.",
            "Donate urad (a type of pulse), oil, sapphire, black sesame seeds, black buffalo, iron, money and black clothes as per your financial situation to poor and needy people.",
            "Wearing of seven faced Rudraksha tends to mitigate the ill effects of Sadhe Sati."
          ]
        }
      ]
    },
    "gemstones": [
      {
        "type": "SPECIAL",
        "heading": "Gemstone Suggestions",
        "data": {
          "LIFE": {
            "name": "Red Coral",
            "gem_key": "red_coral",
            "semi_gem": "Red Agate",
            "wear_finger": "Ring",
            "weight_caret": "6 - 10.25",
            "wear_metal": "Gold",
            "wear_day": "Tuesday",
            "gem_deity": "Mars"
          },
          "BENEFIC": {
            "name": "Ruby",
            "gem_key": "ruby",
            "semi_gem": "Red Garnet",
            "wear_finger": "Ring",
            "weight_caret": "3 - 4.25",
            "wear_metal": "Gold",
            "wear_day": "Sunday",
            "gem_deity": "Sun"
          },
          "LUCKY": {
            "name": "Yellow Sapphire",
            "gem_key": "yellow_sapphire",
            "semi_gem": "Topaz",
            "wear_finger": "Index",
            "weight_caret": "4 - 5.25",
            "wear_metal": "Gold",
            "wear_day": "Thursday",
            "gem_deity": "Jupiter"
          }
        }
      }
    ]
  }